{
  "architectures": [
    "MethodGraphBertNodeClassification"
  ],
  "attention_probs_dropout_prob": 0.3,
  "bos_token_id": 0,
  "do_sample": false,
  "eos_token_ids": 0,
  "finetuning_task": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.5,
  "hidden_size": 32,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1"
  },
  "initializer_range": 0.02,
  "intermediate_size": 32,
  "is_decoder": false,
  "k": 7,
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1
  },
  "layer_norm_eps": 1e-12,
  "length_penalty": 1.0,
  "max_hop_dis_index": 100,
  "max_inti_pos_index": 100,
  "max_length": 20,
  "max_wl_role_index": 100,
  "model_type": "",
  "num_attention_heads": 2,
  "num_beams": 1,
  "num_hidden_layers": 2,
  "num_labels": 2,
  "num_return_sequences": 1,
  "output_attentions": false,
  "output_hidden_states": false,
  "output_past": true,
  "pad_token_id": 0,
  "pruned_heads": {},
  "repetition_penalty": 1.0,
  "residual_type": "graph_raw",
  "temperature": 1.0,
  "top_k": 50,
  "top_p": 1.0,
  "torchscript": false,
  "use_bfloat16": false,
  "x_size": 1433,
  "y_size": 7
}
